; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob9) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 crate16 crate17 crate18 crate19 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate18)
	(at pallet1 depot1)
	(clear crate13)
	(at pallet2 depot2)
	(clear crate17)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear crate15)
	(at pallet5 distributor2)
	(clear crate16)
	(at pallet6 depot2)
	(clear crate19)
	(at pallet7 depot2)
	(clear crate14)
	(at pallet8 distributor2)
	(clear pallet8)
	(at truck0 distributor0)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot0)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at hoist13 distributor2)
	(available hoist13)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor0)
	(on crate1 pallet3)
	(at crate2 depot0)
	(on crate2 crate0)
	(at crate3 distributor2)
	(on crate3 pallet5)
	(at crate4 distributor0)
	(on crate4 crate1)
	(at crate5 depot2)
	(on crate5 pallet6)
	(at crate6 distributor1)
	(on crate6 pallet4)
	(at crate7 depot0)
	(on crate7 crate2)
	(at crate8 depot1)
	(on crate8 pallet1)
	(at crate9 depot1)
	(on crate9 crate8)
	(at crate10 depot2)
	(on crate10 crate5)
	(at crate11 depot2)
	(on crate11 pallet7)
	(at crate12 depot2)
	(on crate12 pallet2)
	(at crate13 depot1)
	(on crate13 crate9)
	(at crate14 depot2)
	(on crate14 crate11)
	(at crate15 distributor1)
	(on crate15 crate6)
	(at crate16 distributor2)
	(on crate16 crate3)
	(at crate17 depot2)
	(on crate17 crate12)
	(at crate18 depot0)
	(on crate18 crate7)
	(at crate19 depot2)
	(on crate19 crate10)
)

(:goal (and
		(on crate1 crate6)
		(on crate2 crate12)
		(on crate3 pallet6)
		(on crate4 pallet2)
		(on crate6 pallet4)
		(on crate7 pallet0)
		(on crate8 crate16)
		(on crate11 crate7)
		(on crate12 pallet8)
		(on crate13 crate11)
		(on crate14 pallet7)
		(on crate15 crate4)
		(on crate16 pallet1)
		(on crate19 pallet5)
	)
))

; plan
1. (lift hoist9 crate17 crate12 depot2)
   deleted: (at crate17 depot2) (clear crate17) (available hoist9) (on crate17 crate12)
   added: (lifting hoist9 crate17) (clear crate12)
   goals met: 1 of 14
2. (lift hoist11 crate18 crate7 depot0)
   deleted: (at crate18 depot0) (clear crate18) (available hoist11) (on crate18 crate7)
   added: (lifting hoist11 crate18) (clear crate7)
   goals met: 1 of 14
3. (lift hoist6 crate15 crate6 distributor1)
   deleted: (at crate15 distributor1) (clear crate15) (available hoist6) (on crate15 crate6)
   added: (lifting hoist6 crate15) (clear crate6)
   goals met: 1 of 14
4. (lift hoist8 crate16 crate3 distributor2)
   deleted: (at crate16 distributor2) (clear crate16) (available hoist8) (on crate16 crate3)
   added: (lifting hoist8 crate16) (clear crate3)
   goals met: 1 of 14
5. (lift hoist7 crate3 pallet5 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist7) (on crate3 pallet5)
   added: (lifting hoist7 crate3) (clear pallet5)
   goals met: 1 of 14
6. (lift hoist12 crate7 crate2 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist12) (on crate7 crate2)
   added: (lifting hoist12 crate7) (clear crate2)
   goals met: 1 of 14
7. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   goals met: 1 of 14
8. (lift hoist3 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate1)
   added: (lifting hoist3 crate4) (clear crate1)
   goals met: 1 of 14
9. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 1 of 14
10. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 1 of 14
11. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 1 of 14
12. (load hoist8 crate16 truck1 distributor2)
   deleted: (lifting hoist8 crate16)
   added: (in crate16 truck1) (available hoist8)
   goals met: 1 of 14
13. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 1 of 14
14. (lift hoist3 crate1 pallet3 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet3)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 1 of 14
15. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 1 of 14
16. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   goals met: 1 of 14
17. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 1 of 14
18. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 1 of 14
19. (drop hoist12 crate7 pallet0 depot0)
   deleted: (lifting hoist12 crate7) (clear pallet0)
   added: (available hoist12) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 2 of 14
20. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 2 of 14
21. (load hoist3 crate1 truck1 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck1) (available hoist3)
   goals met: 2 of 14
22. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 2 of 14
23. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 2 of 14
24. (load hoist7 crate3 truck1 distributor2)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck1) (available hoist7)
   goals met: 2 of 14
25. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 2 of 14
26. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 2 of 14
27. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 2 of 14
28. (unload hoist4 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 2 of 14
29. (load hoist6 crate15 truck0 distributor1)
   deleted: (lifting hoist6 crate15)
   added: (in crate15 truck0) (available hoist6)
   goals met: 2 of 14
30. (load hoist4 crate4 truck0 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck0) (available hoist4)
   goals met: 2 of 14
31. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 2 of 14
32. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 2 of 14
33. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 2 of 14
34. (unload hoist6 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist6)
   added: (lifting hoist6 crate1)
   goals met: 2 of 14
35. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 2 of 14
36. (drop hoist6 crate1 crate6 distributor1)
   deleted: (lifting hoist6 crate1) (clear crate6)
   added: (available hoist6) (at crate1 distributor1) (clear crate1) (on crate1 crate6)
   goals met: 3 of 14
37. (lift hoist1 crate13 crate9 depot1)
   deleted: (at crate13 depot1) (clear crate13) (available hoist1) (on crate13 crate9)
   added: (lifting hoist1 crate13) (clear crate9)
   goals met: 3 of 14
38. (load hoist1 crate13 truck1 depot1)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck1) (available hoist1)
   goals met: 3 of 14
39. (unload hoist1 crate16 truck1 depot1)
   deleted: (in crate16 truck1) (available hoist1)
   added: (lifting hoist1 crate16)
   goals met: 3 of 14
40. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 3 of 14
41. (drop hoist1 crate16 crate9 depot1)
   deleted: (lifting hoist1 crate16) (clear crate9)
   added: (available hoist1) (at crate16 depot1) (clear crate16) (on crate16 crate9)
   goals met: 3 of 14
42. (lift hoist2 crate14 crate11 depot2)
   deleted: (at crate14 depot2) (clear crate14) (available hoist2) (on crate14 crate11)
   added: (lifting hoist2 crate14) (clear crate11)
   goals met: 3 of 14
43. (load hoist9 crate17 truck1 depot2)
   deleted: (lifting hoist9 crate17)
   added: (in crate17 truck1) (available hoist9)
   goals met: 3 of 14
44. (unload hoist9 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist9)
   added: (lifting hoist9 crate4)
   goals met: 3 of 14
45. (load hoist2 crate14 truck1 depot2)
   deleted: (lifting hoist2 crate14)
   added: (in crate14 truck1) (available hoist2)
   goals met: 3 of 14
46. (lift hoist2 crate19 crate10 depot2)
   deleted: (at crate19 depot2) (clear crate19) (available hoist2) (on crate19 crate10)
   added: (lifting hoist2 crate19) (clear crate10)
   goals met: 3 of 14
47. (load hoist2 crate19 truck1 depot2)
   deleted: (lifting hoist2 crate19)
   added: (in crate19 truck1) (available hoist2)
   goals met: 3 of 14
48. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 3 of 14
49. (unload hoist8 crate19 truck1 distributor2)
   deleted: (in crate19 truck1) (available hoist8)
   added: (lifting hoist8 crate19)
   goals met: 3 of 14
50. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 3 of 14
51. (drop hoist8 crate19 pallet5 distributor2)
   deleted: (lifting hoist8 crate19) (clear pallet5)
   added: (available hoist8) (at crate19 distributor2) (clear crate19) (on crate19 pallet5)
   goals met: 4 of 14
52. (unload hoist2 crate13 truck1 depot2)
   deleted: (in crate13 truck1) (available hoist2)
   added: (lifting hoist2 crate13)
   goals met: 4 of 14
53. (drop hoist9 crate4 crate10 depot2)
   deleted: (lifting hoist9 crate4) (clear crate10)
   added: (available hoist9) (at crate4 depot2) (clear crate4) (on crate4 crate10)
   goals met: 4 of 14
54. (drop hoist2 crate13 crate11 depot2)
   deleted: (lifting hoist2 crate13) (clear crate11)
   added: (available hoist2) (at crate13 depot2) (clear crate13) (on crate13 crate11)
   goals met: 5 of 14
55. (lift hoist9 crate12 pallet2 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist9) (on crate12 pallet2)
   added: (lifting hoist9 crate12) (clear pallet2)
   goals met: 5 of 14
56. (load hoist9 crate12 truck0 depot2)
   deleted: (lifting hoist9 crate12)
   added: (in crate12 truck0) (available hoist9)
   goals met: 5 of 14
57. (unload hoist9 crate15 truck0 depot2)
   deleted: (in crate15 truck0) (available hoist9)
   added: (lifting hoist9 crate15)
   goals met: 5 of 14
58. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 5 of 14
59. (unload hoist8 crate12 truck0 distributor2)
   deleted: (in crate12 truck0) (available hoist8)
   added: (lifting hoist8 crate12)
   goals met: 5 of 14
60. (drop hoist8 crate12 pallet8 distributor2)
   deleted: (lifting hoist8 crate12) (clear pallet8)
   added: (available hoist8) (at crate12 distributor2) (clear crate12) (on crate12 pallet8)
   goals met: 6 of 14
61. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 6 of 14
62. (unload hoist8 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 6 of 14
63. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 6 of 14
64. (drop hoist8 crate2 crate12 distributor2)
   deleted: (lifting hoist8 crate2) (clear crate12)
   added: (available hoist8) (at crate2 distributor2) (clear crate2) (on crate2 crate12)
   goals met: 7 of 14
65. (lift hoist2 crate13 crate11 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist2) (on crate13 crate11)
   added: (lifting hoist2 crate13) (clear crate11)
   goals met: 6 of 14
66. (load hoist9 crate15 truck1 depot2)
   deleted: (lifting hoist9 crate15)
   added: (in crate15 truck1) (available hoist9)
   goals met: 6 of 14
67. (drop hoist2 crate13 crate11 depot2)
   deleted: (lifting hoist2 crate13) (clear crate11)
   added: (available hoist2) (at crate13 depot2) (clear crate13) (on crate13 crate11)
   goals met: 7 of 14
68. (lift hoist9 crate4 crate10 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist9) (on crate4 crate10)
   added: (lifting hoist9 crate4) (clear crate10)
   goals met: 7 of 14
69. (drop hoist9 crate4 pallet2 depot2)
   deleted: (lifting hoist9 crate4) (clear pallet2)
   added: (available hoist9) (at crate4 depot2) (clear crate4) (on crate4 pallet2)
   goals met: 8 of 14
70. (unload hoist9 crate15 truck1 depot2)
   deleted: (in crate15 truck1) (available hoist9)
   added: (lifting hoist9 crate15)
   goals met: 8 of 14
71. (drop hoist9 crate15 crate4 depot2)
   deleted: (lifting hoist9 crate15) (clear crate4)
   added: (available hoist9) (at crate15 depot2) (clear crate15) (on crate15 crate4)
   goals met: 9 of 14
72. (lift hoist9 crate13 crate11 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist9) (on crate13 crate11)
   added: (lifting hoist9 crate13) (clear crate11)
   goals met: 8 of 14
73. (lift hoist2 crate11 pallet7 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 pallet7)
   added: (lifting hoist2 crate11) (clear pallet7)
   goals met: 8 of 14
74. (load hoist9 crate13 truck1 depot2)
   deleted: (lifting hoist9 crate13)
   added: (in crate13 truck1) (available hoist9)
   goals met: 8 of 14
75. (load hoist2 crate11 truck1 depot2)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck1) (available hoist2)
   goals met: 8 of 14
76. (unload hoist9 crate14 truck1 depot2)
   deleted: (in crate14 truck1) (available hoist9)
   added: (lifting hoist9 crate14)
   goals met: 8 of 14
77. (drop hoist9 crate14 pallet7 depot2)
   deleted: (lifting hoist9 crate14) (clear pallet7)
   added: (available hoist9) (at crate14 depot2) (clear crate14) (on crate14 pallet7)
   goals met: 9 of 14
78. (unload hoist9 crate13 truck1 depot2)
   deleted: (in crate13 truck1) (available hoist9)
   added: (lifting hoist9 crate13)
   goals met: 9 of 14
79. (unload hoist2 crate11 truck1 depot2)
   deleted: (in crate11 truck1) (available hoist2)
   added: (lifting hoist2 crate11)
   goals met: 9 of 14
80. (drop hoist2 crate11 crate15 depot2)
   deleted: (lifting hoist2 crate11) (clear crate15)
   added: (available hoist2) (at crate11 depot2) (clear crate11) (on crate11 crate15)
   goals met: 9 of 14
81. (drop hoist9 crate13 crate11 depot2)
   deleted: (lifting hoist9 crate13) (clear crate11)
   added: (available hoist9) (at crate13 depot2) (clear crate13) (on crate13 crate11)
   goals met: 10 of 14
82. (unload hoist9 crate3 truck1 depot2)
   deleted: (in crate3 truck1) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 10 of 14
83. (lift hoist2 crate10 crate5 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist2) (on crate10 crate5)
   added: (lifting hoist2 crate10) (clear crate5)
   goals met: 10 of 14
84. (load hoist2 crate10 truck1 depot2)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   goals met: 10 of 14
85. (lift hoist2 crate5 pallet6 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 pallet6)
   added: (lifting hoist2 crate5) (clear pallet6)
   goals met: 10 of 14
86. (drop hoist9 crate3 pallet6 depot2)
   deleted: (lifting hoist9 crate3) (clear pallet6)
   added: (available hoist9) (at crate3 depot2) (clear crate3) (on crate3 pallet6)
   goals met: 11 of 14
87. (lift hoist9 crate13 crate11 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist9) (on crate13 crate11)
   added: (lifting hoist9 crate13) (clear crate11)
   goals met: 10 of 14
88. (load hoist9 crate13 truck1 depot2)
   deleted: (lifting hoist9 crate13)
   added: (in crate13 truck1) (available hoist9)
   goals met: 10 of 14
89. (lift hoist9 crate11 crate15 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist9) (on crate11 crate15)
   added: (lifting hoist9 crate11) (clear crate15)
   goals met: 10 of 14
90. (load hoist9 crate11 truck1 depot2)
   deleted: (lifting hoist9 crate11)
   added: (in crate11 truck1) (available hoist9)
   goals met: 10 of 14
91. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 10 of 14
92. (unload hoist12 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist12)
   added: (lifting hoist12 crate13)
   goals met: 10 of 14
93. (lift hoist1 crate16 crate9 depot1)
   deleted: (at crate16 depot1) (clear crate16) (available hoist1) (on crate16 crate9)
   added: (lifting hoist1 crate16) (clear crate9)
   goals met: 10 of 14
94. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 10 of 14
95. (drop hoist1 crate16 crate9 depot1)
   deleted: (lifting hoist1 crate16) (clear crate9)
   added: (available hoist1) (at crate16 depot1) (clear crate16) (on crate16 crate9)
   goals met: 10 of 14
96. (unload hoist9 crate11 truck1 depot2)
   deleted: (in crate11 truck1) (available hoist9)
   added: (lifting hoist9 crate11)
   goals met: 10 of 14
97. (drop hoist9 crate11 crate3 depot2)
   deleted: (lifting hoist9 crate11) (clear crate3)
   added: (available hoist9) (at crate11 depot2) (clear crate11) (on crate11 crate3)
   goals met: 10 of 14
98. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 10 of 14
99. (load hoist12 crate13 truck0 depot0)
   deleted: (lifting hoist12 crate13)
   added: (in crate13 truck0) (available hoist12)
   goals met: 10 of 14
100. (lift hoist9 crate11 crate3 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist9) (on crate11 crate3)
   added: (lifting hoist9 crate11) (clear crate3)
   goals met: 10 of 14
101. (load hoist9 crate11 truck1 depot2)
   deleted: (lifting hoist9 crate11)
   added: (in crate11 truck1) (available hoist9)
   goals met: 10 of 14
102. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 10 of 14
103. (unload hoist12 crate13 truck0 depot0)
   deleted: (in crate13 truck0) (available hoist12)
   added: (lifting hoist12 crate13)
   goals met: 10 of 14
104. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 10 of 14
105. (load hoist12 crate13 truck0 depot0)
   deleted: (lifting hoist12 crate13)
   added: (in crate13 truck0) (available hoist12)
   goals met: 10 of 14
106. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 10 of 14
107. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 10 of 14
108. (unload hoist12 crate11 truck1 depot0)
   deleted: (in crate11 truck1) (available hoist12)
   added: (lifting hoist12 crate11)
   goals met: 10 of 14
109. (drop hoist12 crate11 crate7 depot0)
   deleted: (lifting hoist12 crate11) (clear crate7)
   added: (available hoist12) (at crate11 depot0) (clear crate11) (on crate11 crate7)
   goals met: 11 of 14
110. (lift hoist1 crate16 crate9 depot1)
   deleted: (at crate16 depot1) (clear crate16) (available hoist1) (on crate16 crate9)
   added: (lifting hoist1 crate16) (clear crate9)
   goals met: 11 of 14
111. (load hoist1 crate16 truck0 depot1)
   deleted: (lifting hoist1 crate16)
   added: (in crate16 truck0) (available hoist1)
   goals met: 11 of 14
112. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 11 of 14
113. (unload hoist12 crate13 truck0 depot0)
   deleted: (in crate13 truck0) (available hoist12)
   added: (lifting hoist12 crate13)
   goals met: 11 of 14
114. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 11 of 14
115. (drop hoist12 crate13 crate11 depot0)
   deleted: (lifting hoist12 crate13) (clear crate11)
   added: (available hoist12) (at crate13 depot0) (clear crate13) (on crate13 crate11)
   goals met: 12 of 14
116. (lift hoist1 crate9 crate8 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 crate8)
   added: (lifting hoist1 crate9) (clear crate8)
   goals met: 12 of 14
117. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 12 of 14
118. (lift hoist1 crate8 pallet1 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 pallet1)
   added: (lifting hoist1 crate8) (clear pallet1)
   goals met: 12 of 14
119. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 12 of 14
120. (unload hoist12 crate16 truck0 depot0)
   deleted: (in crate16 truck0) (available hoist12)
   added: (lifting hoist12 crate16)
   goals met: 12 of 14
121. (drop hoist12 crate16 crate13 depot0)
   deleted: (lifting hoist12 crate16) (clear crate13)
   added: (available hoist12) (at crate16 depot0) (clear crate16) (on crate16 crate13)
   goals met: 12 of 14
122. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 12 of 14
123. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 12 of 14
124. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 12 of 14
125. (unload hoist12 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist12)
   added: (lifting hoist12 crate8)
   goals met: 12 of 14
126. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   goals met: 12 of 14
127. (lift hoist0 crate16 crate13 depot0)
   deleted: (at crate16 depot0) (clear crate16) (available hoist0) (on crate16 crate13)
   added: (lifting hoist0 crate16) (clear crate13)
   goals met: 12 of 14
128. (load hoist0 crate16 truck1 depot0)
   deleted: (lifting hoist0 crate16)
   added: (in crate16 truck1) (available hoist0)
   goals met: 12 of 14
129. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 12 of 14
130. (unload hoist1 crate16 truck1 depot1)
   deleted: (in crate16 truck1) (available hoist1)
   added: (lifting hoist1 crate16)
   goals met: 12 of 14
131. (drop hoist1 crate16 pallet1 depot1)
   deleted: (lifting hoist1 crate16) (clear pallet1)
   added: (available hoist1) (at crate16 depot1) (clear crate16) (on crate16 pallet1)
   goals met: 13 of 14
132. (load hoist12 crate8 truck0 depot0)
   deleted: (lifting hoist12 crate8)
   added: (in crate8 truck0) (available hoist12)
   goals met: 13 of 14
133. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 13 of 14
134. (unload hoist1 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 13 of 14
135. (drop hoist1 crate8 crate16 depot1)
   deleted: (lifting hoist1 crate8) (clear crate16)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 crate16)
   goals met: 14 of 14
